#part1 โจทย์รับข้อมูล ให้แยกหลัก แสดงออกแต่ละหลัก แสดงผลคูณแต่ละหลัก
#part2 ให้แสดงข้อมูล โดยถ้าหลักไหนคือเลขคู่แล้วน้อยกว่าเท่ากับ4ให้แสดงค่าAถ้ามากกว่า4ให้แสดงค่าXถ้าคือเลขคี่ให้แสดงเลขหลักนั้นยกกำลัง3ดูที่ภาพ
print('--- Part 1 ---')
i=input('Integer (100-999): ')
a=int(i[0])
b=int(i[1])
c=int(i[2])
print('a = %d, b = %d and c = %d'%(a,b,c))
print('Multiplication of %d, %d and %d is %d.'%(a,b,c,a*b*c))
print('\n--- Part 2 ---')
#เช็คหลักที่ 0 
if (a%2==0):#เช็คเลขคู่มั้ย
    if a<=4:#เช็คว่าน้อยกว่าเท่ากับ 4 มั้ย
        a='A'
    else:#ถ้าไม่น้อยกว่าเท่ากับ 4 แสดงว่า มากกว่า4
        a='X'
else:#ถ้าไม่ใช่เลขคู่แสดงว่าคือเลขคี่
    a=str(a**3)
#ทำซ้ำ ทุกหลัก b c
if (b%2==0):
    if b<=4:
        b='A'
    else:
        b='X'
else:
    b=str(b**3)
    
if (c%2==0):
    if c<=4:
        c='A'
    else:
        c='X'
else:
    c=str(c**3)
print('Input is %s\nOutput is %s%s%s'%(i,a,b,c))